In [2]:
############# pandas 2강 - DataFrame 인덱싱 이해하기

In [3]:
import pandas as pd
import numpy as np

In [11]:
data = {"names":["kilho","kilho","kilho","woncheol","woncheol"],
       "year":[2014,2015,2016,2017,2016],
       "points":[1.5,1.7,3.5,2.5,6.6]}
df = pd.DataFrame(data, columns=["year","names","points","penalty"],
                         index=["one","two","three","four","five"])

In [12]:
df

       year     names  points penalty
one    2014     kilho     1.5     NaN
two    2015     kilho     1.7     NaN
three  2016     kilho     3.5     NaN
four   2017  woncheol     2.5     NaN
five   2016  woncheol     6.6     NaN

In [13]:
df["year"]

one      2014
two      2015
three    2016
four     2017
five     2016
Name: year, dtype: int64

In [14]:
df.year

one      2014
two      2015
three    2016
four     2017
five     2016
Name: year, dtype: int64

In [15]:
df[["year", "points"]]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.5
four   2017     2.5
five   2016     6.6

In [17]:
df.penalty=0.5

In [18]:
df.penalty

one      0.5
two      0.5
three    0.5
four     0.5
five     0.5
Name: penalty, dtype: float64

In [20]:
df

       year     names  points  penalty
one    2014     kilho     1.5      0.5
two    2015     kilho     1.7      0.5
three  2016     kilho     3.5      0.5
four   2017  woncheol     2.5      0.5
five   2016  woncheol     6.6      0.5

In [22]:
df.penalty = [0.1, 0.2, 0.3, 0.4, 0.5]

In [23]:
df

       year     names  points  penalty
one    2014     kilho     1.5      0.1
two    2015     kilho     1.7      0.2
three  2016     kilho     3.5      0.3
four   2017  woncheol     2.5      0.4
five   2016  woncheol     6.6      0.5

In [24]:
df["zeros"]=np.arange(5)

In [26]:
df

       year     names  points  penalty  zeros
one    2014     kilho     1.5      0.1      0
two    2015     kilho     1.7      0.2      1
three  2016     kilho     3.5      0.3      2
four   2017  woncheol     2.5      0.4      3
five   2016  woncheol     6.6      0.5      4

In [27]:
val = pd.Series([1.2, -1.5, -1.7], index=["two","four","five"])

In [30]:
df["debt"] = val

In [31]:
df

       year     names  points  penalty  zeros  debt
one    2014     kilho     1.5      0.1      0   NaN
two    2015     kilho     1.7      0.2      1   1.2
three  2016     kilho     3.5      0.3      2   NaN
four   2017  woncheol     2.5      0.4      3  -1.5
five   2016  woncheol     6.6      0.5      4  -1.7

In [32]:
df["net_points"]=df.points - df.penalty

In [36]:
df.high_points = df.net_points > 2.0

In [38]:
df

       year     names  points  penalty  zeros  debt  net_points  high_points
one    2014     kilho     1.5      0.1      0   NaN         1.4        False
two    2015     kilho     1.7      0.2      1   1.2         1.5        False
three  2016     kilho     3.5      0.3      2   NaN         3.2         True
four   2017  woncheol     2.5      0.4      3  -1.5         2.1         True
five   2016  woncheol     6.6      0.5      4  -1.7         6.1         True

In [2]:
# del df["high_points"]

In [1]:
# del df["net_points"]

In [45]:
df

       year     names  points  penalty  zeros  debt
one    2014     kilho     1.5      0.1      0   NaN
two    2015     kilho     1.7      0.2      1   1.2
three  2016     kilho     3.5      0.3      2   NaN
four   2017  woncheol     2.5      0.4      3  -1.5
five   2016  woncheol     6.6      0.5      4  -1.7

In [47]:
del df["zeros"]

In [49]:
df

       year     names  points  penalty  debt
one    2014     kilho     1.5      0.1   NaN
two    2015     kilho     1.7      0.2   1.2
three  2016     kilho     3.5      0.3   NaN
four   2017  woncheol     2.5      0.4  -1.5
five   2016  woncheol     6.6      0.5  -1.7

In [50]:
df.columns

Index(['year', 'names', 'points', 'penalty', 'debt'], dtype='object')

In [52]:
df.index.name = "Order"
df.columns.name = "Info"

In [53]:
df

Info   year     names  points  penalty  debt
Order
one    2014     kilho     1.5      0.1   NaN
two    2015     kilho     1.7      0.2   1.2
three  2016     kilho     3.5      0.3   NaN
four   2017  woncheol     2.5      0.4  -1.5
five   2016  woncheol     6.6      0.5  -1.7

In [54]:
df[0:3]

Info   year  names  points  penalty  debt
Order
one    2014  kilho     1.5      0.1   NaN
two    2015  kilho     1.7      0.2   1.2
three  2016  kilho     3.5      0.3   NaN

In [55]:
df["two":"four"]

Info   year     names  points  penalty  debt
Order
two    2015     kilho     1.7      0.2   1.2
three  2016     kilho     3.5      0.3   NaN
four   2017  woncheol     2.5      0.4  -1.5

In [60]:
df.loc["two"]

Info
year        2015
names      kilho
points       1.7
penalty      0.2
debt         1.2
Name: two, dtype: object

In [64]:
df.loc["two":"four"]

Info   year     names  points  penalty  debt
Order
two    2015     kilho     1.7      0.2   1.2
three  2016     kilho     3.5      0.3   NaN
four   2017  woncheol     2.5      0.4  -1.5

In [65]:
df.loc["two":"four","points"]

Order
two      1.7
three    3.5
four     2.5
Name: points, dtype: float64

In [66]:
df.loc[:,"year"]

Order
one      2014
two      2015
three    2016
four     2017
five     2016
Name: year, dtype: int64

In [67]:
df["year"]

Order
one      2014
two      2015
three    2016
four     2017
five     2016
Name: year, dtype: int64

In [68]:
df.year

Order
one      2014
two      2015
three    2016
four     2017
five     2016
Name: year, dtype: int64

In [74]:
df

Info   year     names  points  penalty  debt
Order
one    2014     kilho     1.5      0.1   NaN
two    2015     kilho     1.7      0.2   1.2
three  2016     kilho     3.5      0.3   NaN
four   2017  woncheol     2.5      0.4  -1.5
five   2016  woncheol     6.6      0.5  -1.7

In [77]:
df.loc[:,["year","points"]]

Info   year  points
Order
one    2014     1.5
two    2015     1.7
three  2016     3.5
four   2017     2.5
five   2016     6.6

In [72]:
df.loc["three":"five","year":"penalty"]

Info   year     names  points  penalty
Order
three  2016     kilho     3.5      0.3
four   2017  woncheol     2.5      0.4
five   2016  woncheol     6.6      0.5

In [78]:
df.loc["six",:] = [2013, "Hayoung", 4.0, 0.1, 2.1]

In [79]:
df

Info     year     names  points  penalty  debt
Order
one    2014.0     kilho     1.5      0.1   NaN
two    2015.0     kilho     1.7      0.2   1.2
three  2016.0     kilho     3.5      0.3   NaN
four   2017.0  woncheol     2.5      0.4  -1.5
five   2016.0  woncheol     6.6      0.5  -1.7
six    2013.0   Hayoung     4.0      0.1   2.1

In [80]:
df.iloc[3]

Info
year           2017
names      woncheol
points          2.5
penalty         0.4
debt           -1.5
Name: four, dtype: object

In [82]:
df.iloc[3]

Info
year           2017
names      woncheol
points          2.5
penalty         0.4
debt           -1.5
Name: four, dtype: object

In [83]:
df.iloc[3:5, 0:2]

Info     year     names
Order
four   2017.0  woncheol
five   2016.0  woncheol

In [85]:
df.iloc[[0,1,3],[1,2]]

Info      names  points
Order
one       kilho     1.5
two       kilho     1.7
four   woncheol     2.5

In [87]:
df

Info     year     names  points  penalty  debt
Order
one    2014.0     kilho     1.5      0.1   NaN
two    2015.0     kilho     1.7      0.2   1.2
three  2016.0     kilho     3.5      0.3   NaN
four   2017.0  woncheol     2.5      0.4  -1.5
five   2016.0  woncheol     6.6      0.5  -1.7
six    2013.0   Hayoung     4.0      0.1   2.1

In [88]:
df.iloc[:,1:4]

Info      names  points  penalty
Order
one       kilho     1.5      0.1
two       kilho     1.7      0.2
three     kilho     3.5      0.3
four   woncheol     2.5      0.4
five   woncheol     6.6      0.5
six     Hayoung     4.0      0.1

In [90]:
df.iloc[3,1]

'woncheol'

In [91]:
df

Info     year     names  points  penalty  debt
Order
one    2014.0     kilho     1.5      0.1   NaN
two    2015.0     kilho     1.7      0.2   1.2
three  2016.0     kilho     3.5      0.3   NaN
four   2017.0  woncheol     2.5      0.4  -1.5
five   2016.0  woncheol     6.6      0.5  -1.7
six    2013.0   Hayoung     4.0      0.1   2.1

In [92]:
df["year"] > 2014

Order
one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [93]:
df.loc[df["year"]>2014,:]

Info     year     names  points  penalty  debt
Order
two    2015.0     kilho     1.7      0.2   1.2
three  2016.0     kilho     3.5      0.3   NaN
four   2017.0  woncheol     2.5      0.4  -1.5
five   2016.0  woncheol     6.6      0.5  -1.7

In [96]:
df.loc[df["names"]=="woncheol",["year","names","points"]]

Info     year     names  points
Order
four   2017.0  woncheol     2.5
five   2016.0  woncheol     6.6

In [98]:
df.loc[(df["points"]>2) & (df["points"]<3)]

Info     year     names  points  penalty  debt
Order
four   2017.0  woncheol     2.5      0.4  -1.5

In [100]:
df.loc[df["points"]>3, "penalty"] = 0

In [101]:
df

Info     year     names  points  penalty  debt
Order
one    2014.0     kilho     1.5      0.1   NaN
two    2015.0     kilho     1.7      0.2   1.2
three  2016.0     kilho     3.5      0.0   NaN
four   2017.0  woncheol     2.5      0.4  -1.5
five   2016.0  woncheol     6.6      0.0  -1.7
six    2013.0   Hayoung     4.0      0.0   2.1

In [108]:
df.loc["seven",:] = [2018, "Gyurie", 4.0, 0.2, 3.4]

In [109]:
df

Info     year     names  points  penalty  debt
Order
one    2014.0     kilho     1.5      0.1   NaN
two    2015.0     kilho     1.7      0.2   1.2
three  2016.0     kilho     3.5      0.0   NaN
four   2017.0  woncheol     2.5      0.4  -1.5
five   2016.0  woncheol     6.6      0.0  -1.7
six    2013.0   Hayoung     4.0      0.0   2.1
seven  2018.0    Gyurie     4.0      0.2   3.4